Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ། །
en: “Noble son, then listen carefully and keep my words in mind. I shall explain.

source: དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་སྐྱེས་པའི་ཡུལ་ནི་རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་བཟང་པོ་ཞེས་བྱའོ། །
en: The birthplace of the thus-gone Krakucchanda is known as Excellent City of Royal Palaces.

source: གདུང་ནི་ཀཱ་ཤྱ་པའོ། །
en: His family line is that of Kāśyapa.

source: འོད་ནི་དཔག་ཚད་གཅིག་གོ། །
en: His light extended across one league.

source: ཡབ་ནི་མཆོད་སྦྱིན་ཞེས་བྱའོ། །
en: Worship Gift was his father.

source: སྐྱེད་པའི་ཡུམ་ནི་ཚངས་རྒྱལ་ཞེས་བྱའོ། །
en: Brahmā Victory was his mother.

source: སྲས་ནི་བླ་མ་ཞེས་བྱའོ། །
en: Supreme was his son.

source: རིམ་གྲོ་པ་ནི་བློ་རྫོགས་ཞེས་བྱའོ། །
en: Perfect Wisdom was his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགེ་སློང་མཁས་པ་ཞེས་བྱའོ། །
en: Among his monks, Master Scholar was foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསྙེན་པ་ཞེས་བྱའོ། །
en: Reciter was foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགེ་སློང་བཞི་ཁྲིའོ། །གཉིས་པ་ལ་ནི་བདུན་ཁྲིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་དྲུག་ཁྲིའོ། །
en: His first congregation consisted of forty thousand monks, his second of seventy thousand monks, and his third contained sixty thousand hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བཞི་ཁྲིའོ། །
en: The extent of his lifespan was forty thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma remained for eighty thousand years.

source: སྐུ་གདུང་ནི་རིལ་པོ་གཅིག་ཏུ་འདུག་གོ། །མཆོད་རྟེན་ཡང་གཅིག་ཏུ་ཟད་དོ། །
en: His relics remained in a single collection and were contained in a single stūpa.

source: དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་སྐྱེས་པའི་ཡུལ་ནི་གྲོང་ཁྱེར་ལྔ་པ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Kanakamuni is known as Fifth City.

source: རིགས་ནི་བྲམ་ཟེའོ། །
en: His family was brahmin.

source: འོད་ནི་དཔག་ཚད་ཕྱེད་དོ། །
en: His light extended across half a league.

source: ཡབ་ནི་མེས་བྱིན་ཞེས་བྱའོ། །
en: Fire Gift was his father.

source: ཡུམ་ནི་བླ་མ་ཞེས་བྱའོ། །
en: Highest was his mother.

source: སྲས་ནི་རྣམ་པར་རྒྱལ་བའི་སྡེ་ཞེས་བྱའོ། །
en: Victorious Army was his son.

source: རིམ་གྲོ་པ་ནི་བཀྲ་ཤིས་ལྡན་ཞེས་བྱའོ། །
en: Auspicious One was his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོག་མ་ཞེས་བྱའོ། །
en: Highest was foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱལ་ཞེས་བྱའོ། །
en: Victory was foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགེ་སློང་བདུན་ཁྲིའོ། །གཉིས་པ་ལ་ནི་དྲུག་ཁྲིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་དགེ་སློང་ལྔ་ཁྲིའོ། །
en: His first congregation consisted of seventy thousand monks, his second of sixty thousand monks, and his third of fifty thousand monks.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སུམ་ཁྲིའོ། །
en: The extent of his lifespan was thirty thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma remained for a thousand years.

source: སྐུ་གདུང་ནི་རིལ་པོ་གཅིག་ཏུ་འདུག་གོ། །
en: His relics remained in a single collection.

source: མཆོད་རྟེན་ཡང་གཅིག་ཏུ་ཟད་དོ། །
en: There was also only one stūpa.

source: དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་སྐྱེས་པའི་ཡུལ་ནི་ཚེ་ཏ་ན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Kāśyapa is known as Cetana.

source: འོད་ནི་རྒྱང་གྲགས་གཅིག་གོ། །
en: His light extended across a mile.

source: ཡབ་ནི་ཚངས་བྱིན་ཞེས་བྱའོ། །
en: Brahmā Gift was his father.

source: ཡུམ་ནི་ནོར་བདག་མ་ཞེས་བྱའོ། །
en: Wealth Possessor was his mother.

source: སྲས་ནི་དེད་དཔོན་ཞེས་བྱའོ། །
en: Leader was his son.

source: རིམ་གྲོ་པ་ནི་ཀུན་གྱི་བཤེས་གཉེན་ཞེས་བྱའོ། །
en: Friend of All was his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བ་ར་དྭཱ་ཛ་ཞེས་བྱའོ། །
en: Bharadvāja was foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐར་རྒྱལ་ཞེས་བྱའོ། །
en: Star King was foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགེ་སློང་ཉི་ཁྲིའོ། །གཉིས་པ་ལ་ནི་ཁྲི་བརྒྱད་སྟོང་ངོ་། །གསུམ་པ་ལ་ནི་ཁྲི་དྲུག་སྟོང་ངོ་། །
en: His first congregation consisted of twenty thousand monks, his second of eighty thousand monks, and his third of sixty thousand monks.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ཉི་ཁྲིའོ། །
en: The extent of his lifespan was twenty thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma remained for seven thousand years.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ང་སྐྱེས་པའི་ཡུལ་ནི་སེར་སྐྱའི་གནས་ཞེས་བྱའོ། །
en: “Prāmodyarāja, I, the thus-gone Śākyamuni, was born in Kapilavastu.

source: རིགས་ནི་རྒྱལ་རིགས་སོ། །གདུང་ནི་གཽ་ཏ་མའོ། །
en: My family is kṣatriya and my lineage that of Gautama.

source: འོད་ནི་འདོམ་གང་ངོ་། །
en: My light extends across one fathom.

source: ཡབ་ནི་ཟས་གཙང་མ་ཞེས་བྱའོ། །
en: Śuddhodana is my father.

source: ཡུམ་ནི་སྒྱུ་འཕྲུལ་ཞེས་བྱའོ། །
en: Māyā is my mother.

source: སྲས་ནི་སྒྲ་གཅན་འཛིན་ཞེས་བྱའོ། །
en: Rāhula is my son.

source: རིམ་གྲོ་པ་ནི་ཀུན་དགའ་བོ་ཞེས་བྱའོ། །
en: Ānanda is my attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཉེ་རྒྱལ་ཞེས་བྱའོ། །
en: Upatiṣya is foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་པང་ནས་སྐྱེས་ཞེས་བྱའོ། །
en: Kolita is foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའོ། །
en: My first congregation consisted of one thousand two hundred and fifty monks.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱའོ། །
en: The extent of my lifespan is one hundred years.

source: དམ་པའི་ཆོས་ནི་ལོ་ལྔ་བརྒྱའི་བར་དུ་གནས་སོ། །
en: My sacred Dharma will remain for five hundred years;

source: ལོ་ལྔ་བརྒྱའི་བར་དུ་ནི་དམ་པའི་ཆོས་ལྟར་བཅོས་པར་སྣང་ངོ་། །
en: for five hundred years there will remain a contrived appearance of the sacred Dharma.

source: སྐུ་གདུང་ནི་རྒྱས་པར་འགྱུར་རོ། །
en: There will be abundant relics.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་དེ་བཞིན་གཤེགས་པ་བྱམས་པ་སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་ཏོག་གི་བློ་གྲོས་ཞེས་བྱའོ། །
en: “Prāmodyarāja, the thus-gone Maitreya will be born in the royal palace of the city known as Crown Intelligence.

source: ཡབ་ནི་ཚངས་བཟངས་ཞེས་བྱའོ། །
en: Excellent Brahmā will be his father.

source: ཡུམ་ནི་ཚངས་བདག་མ་ཞེས་བྱའོ། །
en: Brahmā Lady will be his mother.

source: སྲས་ནི་བསོད་ནམས་སྟོབས་ཞེས་བྱའོ། །
en: Power of Merit will be his son.

source: རིམ་གྲོ་པ་ནི་རྒྱ་མཚོ་ཞེས་བྱའོ། །
en: Ocean will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་འོད་ཅེས་བྱའོ། །
en: Wisdom Light will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བརྩོན་འགྲུས་བརྟན་ཞེས་བྱའོ། །
en: Firm Endeavor will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བཞིའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: His first congregation will consist of nine hundred and sixty million worthy hearers, his second of nine hundred and forty million worthy hearers, and his third of nine hundred and twenty million worthy hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be eighty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་མེ་ཏོག་ལྷ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Siṃha will be the city known as Flower God.

source: རིགས་ནི་རྒྱལ་རིགས་སོ། །
en: His family will be kṣatriya.

source: ཡབ་ནི་སེང་གེ་སྟག་ཅེས་བྱའོ། །
en: Lion Tiger will be his father.

source: ཡུམ་ནི་དགའ་བའི་ང་རོ་ཞེས་བྱའོ། །
en: Cry of Bliss will be his mother.

source: སྲས་ནི་སྟོབས་ཆེན་ཞེས་བྱའོ། །
en: Great Power will be his son.

source: རིམ་གྲོ་པ་ནི་དེས་པ་ཞེས་བྱའོ། །
en: Gentle will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་བརྩེགས་པ་ཞེས་བྱའོ། །
en: Wisdom Mount will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྤྲིན་ལྡན་ཞེས་བྱའོ། །
en: Cloud Bearer will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of one billion members, his second of nine hundred million members, and his third of eight hundred million members.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲིའོ། །
en: The extent of his lifespan will be seventy thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ten million years.

source: དེ་བཞིན་གཤེགས་པ་རབ་གསལ་སྐྱེ་བའི་ཡུལ་ནི་རྒྱུ་སྐར་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Pradyota will be the city known as Star Bearer.

source: འོད་ནི་དཔག་ཚད་ལྔའོ། །
en: His light will extend five leagues.

source: ཡབ་ནི་ལེགས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Excellent Intelligence will be his father.

source: ཡུམ་ནི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower will be his mother.

source: སྲས་ནི་དུས་རིག་ཅེས་བྱའོ། །
en: Time Knower will be his son.

source: རིམ་གྲོ་པ་ནི་དཔའ་བའི་དབང་པོ་ཞེས་བྱའོ། །
en: Leader of Heroes will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀྲ་ཤིས་ཞེས་བྱའོ། །
en: Fortune will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འབྲུག་སྒྲ་ཞེས་བྱའོ། །
en: Sound of Thunder will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བྱེ་བ་ཕྲག་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་དགུའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of one trillion hearers, his second of nine hundred ninety million hearers, and his third of nine hundred eighty million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་དགུའོ། །
en: The extent of his lifespan will be ninety million years.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་ལྔ་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-five thousand years.

source: དེ་བཞིན་གཤེགས་པ་ཐུབ་པ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་མེ་ཏོག་བླ་མ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Muni will be the city known as Highest Flower.

source: ཡབ་ནི་ལྷུན་ཆེན་ཞེས་བྱའོ། །
en: Great Mountain will be his father.

source: ཡུམ་ནི་སྣ་མའི་མེ་ཏོག་འོད་ཅེས་བྱའོ། །
en: Jasmine Flower will be his mother.

source: སྲས་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོག་གི་དམ་པ་ཞེས་བྱའོ། །
en: Truly Supreme will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་ངེས་པའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Certain Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུས་བྱིན་ཞེས་བྱའོ། །
en: Power Gift will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཁྲིའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བཞིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་དགྲ་བཅོམ་པ་དུང་ཕྱུར་ཕྲག་ལྔའོ། །
en: His first congregation will consist of ten thousand hearers, his second of four hundred million hearers, and his third of five hundred million worthy ones.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དྲུག་ཁྲིའོ། །
en: The extent of his lifespan will be sixty thousand years.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་པད་མ་དཀར་པོ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Kusuma will be the city known as White Lotus.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་དོ། །
en: His light will extend eight leagues.

source: ཡབ་ནི་དུས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Time will be his father.

source: སྲས་ནི་སྐྱེ་བའི་དབང་པོ་ཞེས་བྱའོ། །
en: Leader of the People will be his son.

source: རིམ་གྲོ་པ་ནི་བྱང་ཆུབ་དགའ་བ་ཞེས་བྱའོ། །
en: Joy of Awakening will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་སྟོབས་ཞེས་བྱའོ། །
en: Dharma Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མི་ཚུགས་པ་ཞེས་བྱའོ། །
en: Indomitable will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་ཕྲག་དྲུག་ཅུའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གསུམ་དང་བྱེ་བ་ཕྲག་བཞིའོ། །
en: His first congregation will consist of sixty billion hearers, his second of three hundred fifty million hearers, and his third of three hundred forty million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་ལྔ་ཁྲིའོ། །
en: The extent of his lifespan will be fifty thousand years.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་གཉིས་པ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་ཡངས་པ་ཞེས་བྱའོ། །
en: “The birthplace of the second thus-gone one named Kusuma will be called Vast Splendor.

source: ཡབ་ནི་གཙུག་ན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower Crown will be his father.

source: ཡུམ་ནི་ཆོས་ལྡན་མ་ཞེས་བྱའོ། །
en: Endowed with Dharma will be his mother.

source: སྲས་ནི་ལུས་གཙང་ཞེས་བྱའོ། །
en: Pure Body will be his son.

source: རིམ་གྲོ་པ་ནི་བློ་གྲོས་སེམས་པ་ཞེས་བྱའོ། །
en: Keen Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་བ་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Joy will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དགའ་བོ་ཞེས་བྱའོ། །
en: Joyous will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་བཞིའོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་གཅིག་དང་བྱེ་བ་ཕྲག་དྲུག་གོ། །
en: His first congregation will consist of one hundred forty million hearers, his second of one hundred fifty million hearers, and his third of one hundred sixty million hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for one hundred million years.

source: དེ་བཞིན་གཤེགས་པ་སྤྱན་ལེགས་སྐྱེ་བའི་ཡུལ་ནི་བཟང་བྱེད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Sunetra will be called Well Doer.

source: འོད་ནི་དཔག་ཚད་བཅུ་གཉིས་སོ། །
en: His light will extend twelve leagues.

source: ཡབ་ནི་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Jewel will be his father.

source: ཡུམ་ནི་སཱ་ལ་ཅན་ཞེས་བྱའོ། །
en: Endowed with Śāla Trees will be his mother.

source: སྲས་ནི་རྒྱུ་སྐར་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Star King will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་བློ་གྲོས་ཞེས་བྱའོ། །
en: Qualities of Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Intelligence will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་འགྲོས་ཞེས་བྱའོ། །
en: Lion Gait will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་སུམ་འབུམ་མོ། །གཉིས་པ་ལ་ནི་ཉིས་འབུམ་བརྒྱད་སྟོང་ངོ་། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་སུམ་འབུམ་དྲུག་སྟོང་ངོ་། །
en: His first congregation will consist of three hundred thousand hearers, his second of two hundred and eight thousand hearers, and his third of three hundred and six thousand hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་དུང་ཕྱུར་ཕྲག་གསུམ་གྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for three hundred million years.

source: སངས་རྒྱས་བཅུ་པོ་དེ་བཞིན་གཤེགས་པ་དང་པོ་པ་དེ་དག་གིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ཇི་སྙེད་པ་དེ་སྙེད་ཅིག་ནི་དེ་བཞིན་གཤེགས་པ་དེ་གཅིག་པུས་ཀྱང་མཛད་པར་འགྱུར་རོ། །
en: This thus-gone one alone will ripen more sentient beings than all the first ten combined.

source: དེ་བཞིན་གཤེགས་པ་དེད་དཔོན་སྐྱེ་བའི་ཡུལ་ནི་རྒྱལ་པོའི་ཕོ་བྲང་གྲོང་ཁྱེར་མཆོག་མཛེས་ཞེས་བྱའོ། །
en: “The thus-gone Sārthavāha will be born in the royal palace of the city known as Supreme Beauty.

source: འོད་ནི་དཔག་ཚད་སུམ་ཅུ་རྩ་བཞིའོ། །
en: His light will extend thirty-four leagues.

source: ཡབ་ནི་བག་ཚ་བ་མེད་པ་ཞེས་བྱའོ། །
en: Undaunted will be his father.

source: ཡུམ་ནི་ཕན་འདོད་མ་ཞེས་བྱའོ། །
en: Wish to Benefit will be his mother.

source: སྲས་ནི་དགའ་བ་ཞེས་བྱའོ། །
en: Joy will be his son.

source: རིམ་གྲོ་པ་ནི་མཚོ་ཆེན་པོ་ཞེས་བྱའོ། །
en: Ocean will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔལ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Glory will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོད་འོས་ཞེས་བྱའོ། །
en: Worthy of Worship will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་བདུན་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དྲུག་འབུམ་མོ། །གསུམ་པ་ལ་ནི་ལྔ་འབུམ་མོ། །
en: His first congregation will consist of seven hundred thousand hearers, his second of six hundred thousand hearers, and his third of five hundred thousand hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་སྟོང་ངོ་། །
en: The extent of his lifespan will be ten billion years.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་ཁྲི་ཉིས་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ninety-two thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལག་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་འགྲོ་བ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mahābāhu will be called Movement.

source: ཡབ་ནི་བརྩོན་འགྲུས་བྱིན་ཞེས་བྱའོ། །
en: Diligence Gift will be his father.

source: ཡུམ་ནི་དྲང་སྲོང་བྱིན་ཞེས་བྱའོ། །
en: Given by the Sages will be his mother.

source: སྲས་ནི་རྣམ་པར་སྣང་བྱེད་ཅེས་བྱའོ། །
en: Illuminator will be his son.

source: རིམ་གྲོ་པ་ནི་ལེགས་སེམས་ཞེས་བྱའོ། །
en: Excellent Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བག་ཚ་བ་མེད་པའི་ང་རོ་ཞེས་བྱའོ། །
en: Undaunted Roar will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རླུང་ལྟར་འགྲོ་ཞེས་བྱའོ། །
en: Moving like the Wind will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་གཅིག་གོ། །དེ་ཕན་ཆད་ནི་བགྲང་གིས་མི་ལང་ངོ་། །
en: His first congregation will consist of one hundred million hearers, and beyond that innumerably many.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་དུང་ཕྱུར་ཕྲག་བཞིའོ། །
en: The extent of his lifespan will be four hundred million years.

source: དེ་བཞིན་གཤེགས་པ་སྟོབས་ཆེན་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་རིན་པོ་ཆེའི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: “The birthplace of the thus-gone Mahābala will be the city called Jewel Splendor.

source: འོད་ནི་དཔག་ཚད་སུམ་ཅུའོ། །
en: His light will extend thirty leagues.

source: ཡབ་ནི་མཛེས་ལྡན་ཞེས་བྱའོ། །
en: Gorgeous will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་ཅན་མ་ཞེས་བྱའོ། །
en: Splendid will be his mother.

source: སྲས་ནི་སེང་གེའི་འགྲོས་ཞེས་བྱའོ། །
en: Lion Gait will be his son.

source: རིམ་གྲོ་པ་ནི་བཟང་དགའ་ཞེས་བྱའོ། །
en: Excellent Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཆོག་སྦྱིན་ཞེས་བྱའོ། །
en: Supreme Gift will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལེགས་གནས་ཞེས་བྱའོ། །
en: Proper Adherence will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་སུམ་འབུམ་མོ། །གཉིས་པ་ལ་ནི་དེ་ཉིས་འགྱུར་རོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་ཁྲི་འབྱུང་བར་འགྱུར་རོ། །
en: His first congregation will consist of three hundred thousand hearers, his second of twice as many hearers, and his third of ten thousand hearers.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་རྒྱུ་སྐར་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་འཛམ་བུའི་ཆུ་ཀླུང་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Nakṣatrarāja will be the city called Jambu River.

source: འོད་ནི་དཔག་ཚད་བརྒྱའོ། །
en: His light will extend one hundred leagues.

source: ཡབ་ནི་འོད་སྦྱིན་ཞེས་བྱའོ། །
en: Light Gift will be his father.

source: ཡུམ་ནི་ལེགས་པའི་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Excellent Intelligence will be his mother.

source: སྲས་ནི་རྒྱལ་ཞེས་བྱའོ། །
en: Conqueror will be his son.

source: རིམ་གྲོ་པ་ནི་ཡེ་ཤེས་སྟོབས་ཞེས་བྱའོ། །
en: Wisdom Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དྲིས་ལན་དབང་ཕྱུག་ཅེས་བྱའོ། །
en: Master of Discussion will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བྱིན་རླབས་ཞེས་བྱའོ། །
en: Blessing will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་ཐེར་འབུམ་མོ། །གཉིས་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གཅིག་དང་དུང་ཕྱུར་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་ཐེར་འབུམ་ཕྲག་གཅིག་དང་དུང་ཕྱུར་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of one billion hearers, his second of one billion nine hundred million hearers, and his third of one billion eight hundred million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: The extent of his lifespan will be eighty million years.

source: དེ་བཞིན་གཤེགས་པ་རྩི་སྨན་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་སཱ་ལ་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Oṣadhi will be called Endowed with Śāla Trees.

source: ཡབ་ནི་ན་ཚོད་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Youth will be his father.

source: ཡུམ་ནི་ཡིད་འོང་བློ་གྲོས་མ་ཞེས་བྱའོ། །
en: Beautiful Intelligence will be his mother.

source: སྲས་ནི་རི་བོའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Mountain Banner will be his son.

source: རིམ་གྲོ་པ་ནི་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆོས་ཀྱི་འབྱུང་གནས་ཞེས་བྱའོ། །
en: Source of Dharma will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བསོད་ནམས་སྟོབས་ཞེས་བྱའོ། །
en: Power of Merit will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དྲུག་དང་བྱེ་བ་ཕྲག་དགུའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་བདུན་དང་བྱེ་བ་ཕྲག་བརྒྱད་དོ། །
en: His first congregation will consist of seven hundred million hearers, his second of six hundred ninety million hearers, and his third of seven hundred eighty million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བདུན་ཁྲི་བདུན་སྟོང་ངོ་། །
en: The extent of his lifespan will be seventy-seven thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་དྲུག་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for sixty thousand years.

source: དེ་བཞིན་གཤེགས་པ་སྙན་པའི་ཏོག་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་གཟི་བརྗིད་གསལ་བ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Yaśaketu will be called Radiant Splendor.

source: ཡབ་ནི་རབ་གསལ་ཞེས་བྱའོ། །
en: Luminous will be his father.

source: སྲས་ནི་མེ་ཏོག་བླ་མ་ཞེས་བྱའོ། །
en: Highest Flower will be his son.

source: རིམ་གྲོ་པ་ནི་དགའ་བའི་མིག་ཅེས་བྱའོ། །
en: Eye of Joy will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཤེས་རབ་སྟོབས་ཞེས་བྱའོ། །
en: Insight Power will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་སྟོབས་ཞེས་བྱའོ། །
en: Lion Strength will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་སུམ་འབུམ་ཉི་ཁྲིའོ། །གཉིས་པ་ལ་ནི་སུམ་འབུམ་ཆིག་ཁྲིའོ། །འདུས་པ་གསུམ་པ་ལ་ནི་ཉན་ཐོས་སུམ་འབུམ་མོ། །
en: His first congregation will consist of three hundred twenty thousand hearers, his second of three hundred ten thousand hearers, and his third of three hundred thousand hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་གཉིས་སོ། །
en: The extent of his lifespan will be twenty million years.

source: དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བ་ཕྲག་གཉིས་ཀྱི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for twenty million years.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཆེན་པོ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་བདེ་དགའ་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Mahāprabha will be the city called Blissful Joy.

source: འོད་ནི་དཔག་ཚད་བཞི་བཅུའོ། །
en: His light will extend forty leagues.

source: ཡབ་ནི་བ་ཛི་ར་ཞེས་བྱའོ། །
en: Bajira will be his father.

source: ཡུམ་ནི་རྒྱལ་བས་བྱིན་ཞེས་བྱའོ། །
en: Given by the Victor will be his mother.

source: སྲས་ནི་ཟླ་གདུགས་ཞེས་བྱའོ། །
en: Moon Parasol will be his son.

source: རིམ་གྲོ་པ་ནི་རབ་ཏུ་ཞི་བའི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Serene Intelligence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེམས་ཅན་སྙིང་པོ་ཞེས་བྱའོ། །
en: Essence of the Sentient will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དེས་པ་ཞེས་བྱའོ། །
en: Gentle will be foremost in terms of miraculous abilities.

source: འདུས་པ་དང་པོ་ལ་ནི་ཉན་ཐོས་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་བདུན་ནོ། །གཉིས་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་ལྔའོ། །གསུམ་པ་ལ་ནི་དུང་ཕྱུར་ཕྲག་དགུ་དང་བྱེ་བ་ཕྲག་གསུམ་མོ། །
en: His first congregation will consist of nine hundred seventy million hearers, his second of nine hundred fifty million hearers, and his third of nine hundred thirty million hearers.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་སྟོང་ངོ་། །
en: The extent of his lifespan will be one thousand years.

source: དམ་པའི་ཆོས་ནི་ལོ་དགུ་ཁྲིའི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for ninety thousand years.

source: དེ་བཞིན་གཤེགས་པ་གྲོལ་བའི་ཕུང་པོ་སྐྱེ་བའི་ཡུལ་ནི་གྲོང་ཁྱེར་ཟླ་བ་ཅན་ཞེས་བྱའོ། །
en: “The birthplace of the thus-gone Muktiskandha will be the city called Moon Bearer.

source: ཡབ་ནི་ཡིད་བཟངས་ཞེས་བྱའོ། །
en: Excellent Mind will be his father.

source: ཡུམ་ནི་གློག་སྦྱིན་མ་ཞེས་བྱའོ། །
en: Giver of Lightning will be his mother.
